Autodesk.Revit.DB.Structure.RebarHandlesData.GetEndHandle
Gets the end handle tag.
Returns:
Returns the end handle tag.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.SetEndHandle(System.Int32)
Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully.
endHandleTag:
The tag of the end handle.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.GetStartHandle
Gets the start handle tag.
Returns:
Returns the start handle tag.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.SetStartHandle(System.Int32)
Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.
startHandleTag:
The tag of the start handle.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.GetCustomHandles
Gets the handle definitions for the rebar that were added.
Returns:
Returns all custom handles.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.AddCustomHandle(System.Int32)
Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully.
customHandleTag:
The tag of the handle. The tag should be different from the previous ones that were added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
customHandleTag is a duplicate tag.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandlesData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarHandlesData
This class is used to contain the information about the rebar handles defined by an external application.
Remarks:
All handle tags (custom, start, end) should have different values.
Since:
2018